In [83]:
import pandas as pd
import seaborn as sns
from matplotlib import pyplot

In [84]:
temperature_df = pd.read_csv('temperature.csv')
print(temperature_df.head(5))
print(temperature_df.tail(5))

              datetime   Vancouver    Portland  San Francisco     Seattle  \
0  2012-10-01 12:00:00         NaN         NaN            NaN         NaN
1  2012-10-01 13:00:00  284.630000  282.080000     289.480000  281.800000
2  2012-10-01 14:00:00  284.629041  282.083252     289.474993  281.797217
3  2012-10-01 15:00:00  284.626998  282.091866     289.460618  281.789833
4  2012-10-01 16:00:00  284.624955  282.100481     289.446243  281.782449

   Los Angeles   San Diego   Las Vegas     Phoenix  Albuquerque  ...  \
0          NaN         NaN         NaN         NaN          NaN  ...
1   291.870000  291.530000  293.410000  296.600000   285.120000  ...
2   291.868186  291.533501  293.403141  296.608509   285.154558  ...
3   291.862844  291.543355  293.392177  296.631487   285.233952  ...
4   291.857503  291.553209  293.381213  296.654466   285.313345  ...

   Philadelphia    New York    Montreal      Boston   Beersheba  \
0           NaN         NaN         NaN         NaN         NaN
1    285.630000  288.220000  285.830000  287.170000  307.590000
2    285.663208  288.247676  285.834650  287.186092  307.590000
3    285.756824  288.326940  285.847790  287.231672  307.391513
4    285.850440  288.406203  285.860929  287.277251  307.145200

   Tel Aviv District       Eilat  Haifa  Nahariyya  Jerusalem
0                NaN  309.100000    NaN        NaN        NaN
1         305.470000  310.580000  304.4      304.4      303.5
2         304.310000  310.495769  304.4      304.4      303.5
3         304.281841  310.411538  304.4      304.4      303.5
4         304.238015  310.327308  304.4      304.4      303.5

[5 rows x 37 columns]
                  datetime  Vancouver  Portland  San Francisco  Seattle  \
45248  2017-11-29 20:00:00        NaN    282.00            NaN   280.82
45249  2017-11-29 21:00:00        NaN    282.89            NaN   281.65
45250  2017-11-29 22:00:00        NaN    283.39            NaN   282.75
45251  2017-11-29 23:00:00        NaN    283.02            NaN   282.96
45252  2017-11-30 00:00:00        NaN    282.28            NaN   283.04

       Los Angeles  San Diego  Las Vegas  Phoenix  Albuquerque  ...  \
45248       293.55     292.15     289.54   294.71       285.72  ...
45249       295.68     292.74     290.61   295.59       286.45  ...
45250       295.96     292.58     291.34   296.25       286.44  ...
45251       295.65     292.61     292.15   297.15       286.14  ...
45252       294.93     291.40     291.64   297.15       284.70  ...

       Philadelphia  New York  Montreal  Boston  Beersheba  Tel Aviv District  \
45248        290.24       NaN    275.13  288.08        NaN                NaN
45249        289.24       NaN    274.13  286.02        NaN                NaN
45250        286.78       NaN    273.48  283.94        NaN                NaN
45251        284.57       NaN    272.48  282.17        NaN                NaN
45252        283.42       NaN    271.80  280.65        NaN                NaN

       Eilat  Haifa  Nahariyya  Jerusalem
45248    NaN    NaN        NaN        NaN
45249    NaN    NaN        NaN        NaN
45250    NaN    NaN        NaN        NaN
45251    NaN    NaN        NaN        NaN
45252    NaN    NaN        NaN        NaN

[5 rows x 37 columns]

In [85]:
modified_df = temperature_df.iloc[::24]

In [86]:
nyc_df = temperature_df[['datetime','New York']]
nyc_df = nyc_df.iloc[::24]
nyc_df.dropna(how='any', inplace=True)

print(nyc_df.head(5))
print(nyc_df.tail(5))

                datetime    New York
24   2012-10-02 12:00:00  289.991473
48   2012-10-03 12:00:00  290.370000
72   2012-10-04 12:00:00  290.840000
96   2012-10-05 12:00:00  293.180000
120  2012-10-06 12:00:00  288.240000
                  datetime  New York
44352  2017-10-23 12:00:00    289.07
44376  2017-10-24 12:00:00    294.23
44400  2017-10-25 12:00:00    286.15
44424  2017-10-26 12:00:00    284.31
44448  2017-10-27 12:00:00    278.44

In [87]:
nyc_df['New York'] = nyc_df['New York'].apply(lambda x: (x-273.15) * 9/5 + 32)

In [88]:
print(nyc_df.head(5))

                datetime   New York
24   2012-10-02 12:00:00  62.314651
48   2012-10-03 12:00:00  62.996000
72   2012-10-04 12:00:00  63.842000
96   2012-10-05 12:00:00  68.054000
120  2012-10-06 12:00:00  59.162000

In [89]:
print(nyc_df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1852 entries, 24 to 44448
Data columns (total 2 columns):
datetime    1852 non-null object
New York    1852 non-null float64
dtypes: float64(1), object(1)
memory usage: 43.4+ KB
None

In [90]:
nyc_df['datetime'] = pd.to_datetime(nyc_df['datetime'])
nyc_df['year'] = nyc_df['datetime'].dt.year
nyc_df['day'] = nyc_df['datetime'].dt.dayofyear

In [91]:
print(nyc_df.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1852 entries, 24 to 44448
Data columns (total 4 columns):
datetime    1852 non-null datetime64[ns]
New York    1852 non-null float64
year        1852 non-null int64
day         1852 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(2)
memory usage: 72.3 KB
None

In [92]:
nyc_df.columns = ['date','temperature','year','day' ]
nyc_df.reset_index(inplace=True)

In [94]:
print(nyc_df.info())
nyc_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1852 entries, 0 to 1851
Data columns (total 5 columns):
index          1852 non-null int64
date           1852 non-null datetime64[ns]
temperature    1852 non-null float64
year           1852 non-null int64
day            1852 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 72.5 KB
None

   index                date  temperature  year  day
0     24 2012-10-02 12:00:00    62.314651  2012  276
1     48 2012-10-03 12:00:00    62.996000  2012  277
2     72 2012-10-04 12:00:00    63.842000  2012  278
3     96 2012-10-05 12:00:00    68.054000  2012  279
4    120 2012-10-06 12:00:00    59.162000  2012  280